<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f568d4af35c5993b21c174bb5205252fce704862350e00c1b048366a07facd1e","plan_job_ref":"Job Plan Airflow DAGs #10 at https://github.com/cal-itp/data-infra/actions/runs/14600080808","plan_out_hash":"56738f2be2f9d4b19291ce2b00ea95540eb3e07e9873dc6a9f3700508710fd69","plan_hash":"9133dbf9a44420db0de7102a7fa4eba4b75606f92cdca3e7fdcb0ef7acf6362b","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_littlepay_v3/sacrt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/sacrt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/sacrt.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_littlepay_v3/sacrt.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/sacrt.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/sacrt.yml"
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #10](https://github.com/cal-itp/data-infra/actions/runs/14600080808)